config.org
#+PROPERTY: header-args:emacs-lisp :comments both :results discard silent

* Early
:PROPERTIES:
:header-args:emacs-lisp+: :tangle "early-init.el"
:END:

We put some configuration options into early-init.el.

** Garbage Collection

We effectively disable garbage collection while Emacs is starting up by setting the threshold to 1 GiB. This famous hack cuts startup time in half. This section should be located as high as possible in the file so that other commands do not trigger garbage collection. Later on, ~gcmh~ will re-enable garbage collection in idle periods.

#+BEGIN_src emacs-lisp
  (setq gc-cons-threshold #x40000000)
#+end_src

** Constants

#+begin_src emacs-lisp
  (defconst xdg-config-home
    (or (when-let ((dir (getenv "XDG_CONFIG_HOME")))
          (file-name-as-directory dir))
        (when-let ((dir (getenv "HOME")))
          (expand-file-name ".config/" dir))
        (error "Cannot detect configuration directory")))

  (defconst arete-config-dir
    (expand-file-name "arete/" xdg-config-home)
    "The directory that contains local configuration
  where Arete can be extended and variables can be overriden.
  This is a separate repository not integrated with Arete.")

  (defconst arete-local-dir
    (expand-file-name ".local/" user-emacs-directory)
    "The directory that contains all local automatically created files.")

  (defconst arete-cache-dir
    (expand-file-name "cache" arete-local-dir))
#+end_src

** Options

#+begin_src emacs-lisp
  (setopt native-comp-async-report-warnings-errors 'silent)
#+end_src

** The rest

#+begin_src emacs-lisp
  (startup-redirect-eln-cache
   (expand-file-name "eln" arete-cache-dir))

  (setq inhibit-startup-screen t)

  ;; Let it be maximized.
  (setq initial-frame-alist '((fullscreen . maximized)))

  ;; No menu bar, toolbar, scroll bar.
  (setq default-frame-alist
        '((menu-bar-lines . 0)
          (tool-bar-lines . 0)
          (horizontal-scroll-bars)
          (vertical-scroll-bars)))

  (add-to-list 'load-path (expand-file-name "lisp" user-emacs-directory))
#+END_src

* General
:PROPERTIES:
:header-args:emacs-lisp+: :tangle "init.el"
:END:

Most of the configuration goes into init.el.

#+begin_src emacs-lisp
   (defgroup arete nil
    "The group that contains all Arete options.")
#+end_src

** Fonts

#+begin_src emacs-lisp
  (set-fontset-font t 'unicode "FiraCode Nerd Font")
  (set-fontset-font t 'emoji "Noto Color Emoji" nil 'append)
  (set-fontset-font t 'symbol "Symbola monospacified for FiraCode Nerd Font" nil 'append)
  (setq fontset-variable-pitch "-*-*-*-*-*-*-*-*-*-*-*-*-fontset-variable-pitch")
  (new-fontset fontset-variable-pitch nil)
  (set-fontset-font fontset-variable-pitch 'unicode "Fira Sans")
  (set-fontset-font fontset-variable-pitch 'emoji "Noto Color Emoji" nil 'append)
  (set-fontset-font fontset-variable-pitch 'symbol "Symbola" nil 'append)

  (set-face-attribute 'default nil :font "FiraCode Nerd Font" :height 110)
  (set-face-attribute 'fixed-pitch nil :font "FiraCode Nerd Font" :height 110)
  (set-face-attribute 'variable-pitch nil :font "Brygada 1918 Light" :height 140 :fontset fontset-variable-pitch)
#+end_src

** Local Config

*** Variables

Here we define options such as local paths that should be set in a local config.

#+begin_src emacs-lisp
  (defcustom arete-org-dir nil
    "The default directory for org files."
    :group 'arete
    :type 'directory)
#+end_src

*** Pre Init

If the local config directory contains ~config.el~ file, it will be evaluated, so that the local config could set the needed variables and hooks.

#+begin_src emacs-lisp
  (load (expand-file-name "config" arete-config-dir) t)
#+end_src

** Literate Config Goodies

TODO move to use-package for org-mode or org-babel

#+begin_src emacs-lisp
  (defun arete--post-tangle ()
    (message "adjusting tangled file")
    (cond
     ((f-ext? (buffer-file-name) "el")
      (add-file-local-variable-prop-line "lexical-binding" t)))
    (save-buffer))
  ;; (defun arete--literate-init ()
    ;; (make-local-variable 'org-babel-post-tangle-hook)
  ;; (add-hook 'org-babel-post-tangle-hook 'arete--literate-post-tangle nil t)
  (add-hook 'org-babel-post-tangle-hook 'arete--post-tangle)
    ;; )
  ;; (put 'arete--literate-init 'safe-local-eval-function t)
#+end_src

** Use-Package

Enable ~use-package~ statements navigation via ~imenu~. This also includes ~consult-imenu~.

#+begin_src emacs-lisp
  (setopt use-package-enable-imenu-support t)
#+end_src

Tell ~use-package~ to always load features lazily unless told otherwise. It's nicer to have this kind of thing be deterministic: if ~:demand~ is present, the loading is eager; otherwise, the loading is lazy. See https://github.com/jwiegley/use-package#notes-about-lazy-loading.

#+begin_src emacs-lisp
  (setopt use-package-always-defer t)
#+end_src

Built-in features should be configured with ~use-feature~, so that a package manager wouldn't bother to install them. And direct ~use-package~ calls will install packages if not found.

#+begin_src emacs-lisp
  (setopt use-package-always-ensure t)

  (defmacro use-feature (name &rest args)
    "`use-package' that makes sure `ensure' is disabled."
    (declare (indent defun))
    `(use-package ,name
       :ensure nil
       ,@args))
#+end_src

https://github.com/jwiegley/use-package/pull/1029, not included in Emacs for some reason

#+begin_src emacs-lisp
  (defun +use-package/normalize-binder (orig name keyword args)
    (let ((x (car args))
          (y (cdr args)))
      (cond
       ;; (KEY DESC . COMMAND), i.e. (KEY . (DESC . COMMAND))
       ((and (or (stringp x)
                 (vectorp x))
             (consp y)
             (stringp (car y))
             (or (use-package-recognize-function (cdr y) t #'stringp)))
        (list (cons x y)))
       (t
        (funcall orig name keyword args)))))

  (advice-add 'use-package-normalize-binder
              :around #'+use-package/normalize-binder)
#+end_src

** Elpaca

*** Bootstrap

#+begin_src emacs-lisp :tangle no
  (defvar elpaca-installer-version 0.7)
  (defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))
  (defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
  (defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
  (defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
                                :ref nil :depth 1
                                :files (:defaults "elpaca-test.el" (:exclude "extensions"))
                                :build (:not elpaca--activate-package)))
  (let* ((repo  (expand-file-name "elpaca/" elpaca-repos-directory))
         (build (expand-file-name "elpaca/" elpaca-builds-directory))
         (order (cdr elpaca-order))
         (default-directory repo))
    (add-to-list 'load-path (if (file-exists-p build) build repo))
    (unless (file-exists-p repo)
      (make-directory repo t)
      (when (< emacs-major-version 28) (require 'subr-x))
      (condition-case-unless-debug err
          (if-let ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                   ((zerop (apply #'call-process `("git" nil ,buffer t "clone"
                                                   ,@(when-let ((depth (plist-get order :depth)))
                                                       (list (format "--depth=%d" depth) "--no-single-branch"))
                                                   ,(plist-get order :repo) ,repo))))
                   ((zerop (call-process "git" nil buffer t "checkout"
                                         (or (plist-get order :ref) "--"))))
                   (emacs (concat invocation-directory invocation-name))
                   ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
                                         "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                   ((require 'elpaca))
                   ((elpaca-generate-autoloads "elpaca" repo)))
              (progn (message "%s" (buffer-string)) (kill-buffer buffer))
            (error "%s" (with-current-buffer buffer (buffer-string))))
        ((error) (warn "%s" err) (delete-directory repo 'recursive))))
    (unless (require 'elpaca-autoloads nil t)
      (require 'elpaca)
      (elpaca-generate-autoloads "elpaca" repo)
      (load "./elpaca-autoloads")))
  (add-hook 'after-init-hook #'elpaca-process-queues)
  (elpaca `(,@elpaca-order))
#+end_src

*** Elpaca Configuration

#+begin_src emacs-lisp :tangle no
  (elpaca elpaca-use-package (elpaca-use-package-mode))
  (elpaca-wait)
#+end_src

*** Package

#+begin_src emacs-lisp
  (unless (package-installed-p 'vc-use-package)
    (package-vc-install "https://github.com/slotThe/vc-use-package"))
  ;; must be called after setting use-package-always-ensure
  (require 'vc-use-package)
#+end_src

#+begin_src emacs-lisp
  (add-to-list 'package-archives
               '("melpa" . "https://melpa.org/packages/"))
#+end_src

** Garbage Collection Magic Hack

#+begin_src emacs-lisp
  (use-package gcmh
    :custom
    (gcmh-mode t))
#+end_src

** No littering

#+begin_src emacs-lisp
  (use-package no-littering
    :demand t
    :custom
    (no-littering-etc-directory
     (expand-file-name "etc/" arete-local-dir))
    (no-littering-var-directory
      (expand-file-name "data/" arete-local-dir)))
#+end_src

** Recentf

#+begin_src emacs-lisp
  (use-feature recentf
    :config
    (add-to-list 'recentf-exclude
                 (recentf-expand-file-name arete-local-dir)))
#+end_src

